// Survey questions configuration
export const SURVEY_QUESTIONS = [
  {
    id: 15,
    text: "როგორ გსურთ გაგრძელება? 😊",
    type: "multiple_choice",
    options: [
      "შეკვეთის ფორმის შევსება ბოტის დახმარებით",
      "მინდა დაველოდო ადმინისტრატორს"
    ]
  },
  {
    id: 4,
    text: "ატვირთეთ თქვენი ტორტის სურათი ან ინსპირაციის ფოტო (ფაილის ატვირთვა)",
    type: "file"
  },
  {
    id: 3,
    text: "რამდენი ნაჭრიანი უნდა იყოს ტორტი",
    type: "multiple_choice",
    options: [
      "8-10 ნაჭრიანი",
      "10-12 ნაჭრიანი",
      "15-20 ნაჭრიანი",
      "25-30 ნაჭრიანი"
    ]
  },
  {
    id: 16,
    text: "გავაგრძელოთ თუ არა?",
    type: "multiple_choice",
    options: [
      "კი",
      "არა"
    ]
  },
  {
    id: 1,
    text: "გატანის თარიღი?",
    type: "text"
  },
  {
    id: 2,
    text: "გატანის დრო?",
    type: "multiple_choice",
    options: [
      "12:00",
      "15:00",
      "18:00",
      "21:00"
    ]
  },
  {
    id:8,
    text: "სახელი/ასაკი სურვილებისამებრ (მაგალითად: სახელი: გიორგი, ასაკი: 10 წლის)",
    type: "text"
  },
  {
    id:9,
    text: "თქვენი სახელი",
    type: "text"
  },
  {
    id:10,
    text: "თქვენი ტელეფონის ნომერი",
    type: "text"
  },
  {
    id: 11,
    text: "დამატებითი შენიშვნები ან მოთხოვნები:",
    type: "text"
  },
];

